// Задача 29: Напишите программу, которая задаёт массив из 8 элементов
// и выводит их на экран.

//1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

//6, 1, 33-> [6, 1, 33]


    int[] array = { 1, 2, 5, 7, 19, 6, 1, 33};
Console.WriteLine($"{array[0]} {array[1]} {array[2]} {array[3]} {array[4]}");
Console.WriteLine($"{array[5]} {array[6]} {array[7]}");
